MrToast99/Nextube-Remaster/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Flash - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8MB chip, but the original ESP32 MMU can only map 4MB at a time.
# Setting SPIRAM_SIZE to 4MB caps the driver's mapping attempt to the MMU
# limit and suppresses the "Virtual address not enough for PSRAM" warning.
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
# SPIRAM_MALLOC_ALWAYSINTERNAL threshold — standard malloc/calloc calls whose
# size is ≤ this value are allocated from internal SRAM; calls whose size
# exceeds this value are allocated from PSRAM.
#
# This threshold ONLY applies when mbedTLS uses MBEDTLS_DEFAULT_MEM_ALLOC
# (i.e., plain calloc — set below).  Under MBEDTLS_INTERNAL_MEM_ALLOC (the
# IDF 5.x Kconfig default), mbedTLS calls heap_caps_calloc with
# MALLOC_CAP_INTERNAL, bypassing this threshold entirely and forcing ALL
# allocations to SRAM regardless.
#
# With MBEDTLS_DEFAULT_MEM_ALLOC=y and threshold=255:
#   • 16 384 B TLS IN  buffer   > 255 → PSRAM (4 MB free, always succeeds)
#   • 4 096 B  TLS OUT buffer   > 255 → PSRAM
#   • 512 B    RSA-4096 MPI     > 255 → PSRAM
#   • 256 B    RSA-2048 MPI     > 255 → PSRAM
#   • ~280 B   mbedtls_aes_ctx  > 255 → PSRAM
#              (hardware AES reads via CPU reg writes, not DMA — safe in PSRAM)
#   • ≤255 B   WPA2 crypto,     ≤ 255 → SRAM (DMA-accessible, required)
#              FreeRTOS structs,
#              lwIP socket state
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=255
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=4194304

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# Allow heap-allocated task stacks to be placed in SPIRAM so that tasks
# created with xTaskCreate / xTaskCreatePinnedToCore can have their stacks
# served from PSRAM when the SPIRAM-aware malloc decides so (i.e. for stack
# allocations whose size exceeds SPIRAM_MALLOC_ALWAYSINTERNAL=255).  Without
# this, pvPortMalloc in the IDF FreeRTOS port uses MALLOC_CAP_INTERNAL and
# forces all task stacks to internal SRAM regardless of the SPIRAM threshold.
# This keeps SRAM clean for DMA-constrained allocations (lwIP pbufs, WiFi
# crypto buffers) and for the ≤255-byte mbedTLS allocations that stay in SRAM
# by design under MBEDTLS_DEFAULT_MEM_ALLOC.  The MQTT integration adds two
# tasks (ha_mqtt + esp_mqtt internal) with 4 KB stacks each; placing those
# stacks in PSRAM saves ~8 KB of internal SRAM.
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Wi-Fi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# Double the TX buffer pool (default 32) so TLS handshake packets and
# concurrent HTTP responses don't compete and cause EAGAIN on sends.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=10
# Disable predefined (auto) mDNS registration for the AP netif.
# By default IDF 5.x mDNS auto-registers every netif (STA, AP, ETH) when it
# comes up.  We never want the setup AP ("Nextube-Setup") advertised on the
# LAN, so its predefined registration is disabled here — the AP interface is
# never presented to LAN-side mDNS resolvers.
CONFIG_MDNS_PREDEF_NETIF_AP=n
# Disable predefined (auto) mDNS registration for the STA netif.
# wifi_manager.c registers the STA netif explicitly via mdns_register_netif()
# after mdns_init(), and drives the probe/announce cycle from the
# IP_EVENT_STA_GOT_IP handler:
#
#   • New IP (boot, DHCP reassign, new network) → ENABLE_IP4: full
#     probe + announce so the device is advertised on the LAN.
#   • Same IP (reconnect on the same DHCP lease) → ANNOUNCE_IP4: re-announce
#     without re-probing (the hostname claim hasn't changed).
#
# Keeping auto-registration off gives a single, explicit registration path
# rather than also having the daemon install its own LWIP netif-ext callback
# on IP-address changes.  In the 2025 refactored espressif/mdns component the
# explicit mdns_register_netif() call is a pure registry operation: it stores
# the netif pointer in a free slot and installs NO callbacks and NO esp-event
# handlers.  (Without that explicit call, get_if_from_netif() can't find the
# netif and mdns_netif_action() returns ESP_ERR_INVALID_STATE — mDNS would
# never announce.)
CONFIG_MDNS_PREDEF_NETIF_STA=n

# LWIP netif default hostname.
# This controls the name the device uses in DHCP client requests (option 12)
# and is the hostname the mDNS stack reads from the netif during mdns_init().
# Without this, the netif hostname defaults to "espressif", causing the device
# to announce itself as "espressif.localdomain" on the LAN and send mDNS probes
# with "espressif" before mdns_hostname_set() (which is async) takes effect.
# The start_mdns() function also calls esp_netif_set_hostname() at runtime to
# apply the user-configured hostname from config; this default ensures the very
# first probe — fired the moment mdns_init() starts the task — is already
# correct even before that runtime call executes.
CONFIG_LWIP_LOCAL_HOSTNAME="nextube-remaster"

# TLS / HTTPS
# Enable the built-in Mozilla CA certificate bundle so esp_crt_bundle_attach()
# works in the weather HTTP client.  Without this the bundle is empty and
# esp-tls rejects the connection with "No server verification option set".
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Partial bundle (~30 KB, ~40 curated CAs).
# The full bundle (~70 KB, 150+ CAs) is unnecessary — all APIs used by this
# project (Met.no, Open-Meteo, Nominatim, OpenWeatherMap, wttr.in, YouTube,
# Instagram, TikTok, Mastodon) root at CAs in the partial bundle.  The
# smaller binary reduces flash usage and speeds up bundle search during cert
# verification.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_PARTIAL=y
#
# TLS I/O buffer sizing.
# IN must stay at 16 384 — Met.no sends TLS records that fill the maximum
# record size; mbedtls_ssl_read returns -0x7100 (CONN_EOF) with anything
# smaller.  OUT can safely be 4 096: device→server HTTP requests are always
# well under 4 KB.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
#
# TLS memory strategy.
#
# ── Root cause of 0x4290 (MBEDTLS_ERR_RSA_PUBLIC_FAILED | MPI_ALLOC_FAILED) ──
#
# IDF 5.5.3 Kconfig defaults MBEDTLS_MEM_ALLOC_MODE to MBEDTLS_INTERNAL_MEM_ALLOC.
# In that mode, esp_mbedtls_mem_calloc() calls:
#   heap_caps_calloc(n, size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)
# This is an EXPLICIT internal-SRAM request that completely bypasses the
# SPIRAM_MALLOC_ALWAYSINTERNAL threshold.  ALL mbedTLS allocations — including
# the 16 KB TLS IN buffer, the 4 KB OUT buffer, and every 512-byte RSA-4096 MPI
# limb array — go to internal SRAM, not PSRAM.
#
# Without MQTT: SRAM had just enough room for two sequential TLS sessions
# (geocoding + weather) plus RSA temporaries.
#
# With MQTT enabled: the MQTT TCP PCB, event queues, and task TCBs add ~1–2 KB
# of small SRAM allocations.  Those scattered allocations fragment SRAM such
# that after the geocoding TLS session allocates-then-frees its 20 KB of
# mbedTLS buffers, the freed blocks cannot fully coalesce.  The Met.no TLS
# session begins, ssl_setup() gets the 16 KB + 4 KB it needs from the re-used
# block, but by the time certificate verification reaches mbedtls_mpi_exp_mod()
# the remaining contiguous SRAM is too small for the RSA MPI temporaries →
# MBEDTLS_ERR_MPI_ALLOC_FAILED → MBEDTLS_ERR_RSA_PUBLIC_FAILED = 0x4290.
#
# ── Fix ──────────────────────────────────────────────────────────────────────
#
# Select MBEDTLS_DEFAULT_MEM_ALLOC ("Default alloc mode").  In this mode
# esp_mbedtls_mem_calloc() calls plain calloc(n, size), which goes through
# IDF's SPIRAM-aware heap (CONFIG_SPIRAM_USE_MALLOC=y).  Allocations whose
# size exceeds SPIRAM_MALLOC_ALWAYSINTERNAL=255 are served from PSRAM; smaller
# allocations stay in SRAM.  Effect on each allocation class:
#
#   Allocation                  Size     Result with DEFAULT + threshold=255
#   ──────────────────────────  ───────  ───────────────────────────────────
#   TLS IN  buffer              16 384 B > 255 → PSRAM (4 MB free)   ✓
#   TLS OUT buffer               4 096 B > 255 → PSRAM               ✓
#   RSA-4096 MPI limb array        512 B > 255 → PSRAM               ✓
#   RSA-2048 MPI limb array        256 B > 255 → PSRAM               ✓
#   mbedtls_aes_context           ~280 B > 255 → PSRAM               ✓
#     (hardware AES loads key regs via CPU writes, not DMA — PSRAM is safe)
#   WPA2 PSK crypto buffers      ≤ 120 B ≤ 255 → SRAM (DMA-safe)    ✓
#   FreeRTOS TCBs / mutexes      ≤ 200 B ≤ 255 → SRAM               ✓
#
# MBEDTLS_EXTERNAL_MEM_ALLOC was also considered but rejected: it forces ALL
# mbedTLS allocations to PSRAM via heap_caps_calloc(..., MALLOC_CAP_SPIRAM),
# including the WPA2/WPA3 supplicant's AES/SHA context buffers.  On original
# ESP32 the hardware crypto engines access those buffers via DMA, which
# requires MALLOC_CAP_DMA (= internal SRAM).  Routing them to PSRAM causes
# the supplicant to fail → DNS error 202 after Wi-Fi connects.  DEFAULT mode
# avoids this because the threshold keeps small (<= 255 B) supplicant buffers
# in internal SRAM.
#
# MBEDTLS_DYNAMIC_BUFFER was tested and rejected: its "Dynamic Impl" path
# uses heap_caps_malloc(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT) explicitly for
# the record buffers, keeping them in SRAM regardless of this setting.
#
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
#
# Hardware RSA accelerator — DISABLED (software RSA).
# With DEFAULT_MEM_ALLOC + ALWAYSINTERNAL=255, hardware RSA's staging buffers
# (allocated via mbedtls_calloc → calloc → SPIRAM-aware) would also land in
# PSRAM, which is safe for the ESP32 hardware RSA peripheral (it reads
# operands via CPU register writes, not DMA).  However, software RSA is kept
# for simplicity — re-enabling it is a future optimisation.
#
# Performance trade-off: software RSA-4096 on ESP32 at 240 MHz takes roughly
# 200–400 ms per public-key operation (vs ~50 ms hardware).  Weather fetches
# every 10 minutes and social counters every 30 minutes make this latency
# imperceptible in practice.
CONFIG_MBEDTLS_HARDWARE_MPI=n

# MQTT
# Reduce the esp-mqtt internal task stack from the default 6144 bytes to 4096.
# With SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y both the ha_mqtt and esp_mqtt
# stacks reside in PSRAM; this saves ~4 KB of PSRAM vs the 6144-byte default.
CONFIG_MQTT_TASK_STACK_SIZE=4096

# LWIP
CONFIG_LWIP_MAX_SOCKETS=32
CONFIG_LWIP_SNTP_MAX_SERVERS=4

# NVS
CONFIG_NVS_ENCRYPTION=n

# ── IRAM optimisation ─────────────────────────────────────────────────
# IRAM overflows by ~5 KB when esp_jpeg + WiFi + BT all load.
# Move non-ISR-critical code to flash to free headroom.

# FreeRTOS tick hook and utility functions don't need to be in IRAM.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Pixel blits use spi_device_transmit (interrupt/DMA path) to yield the CPU
# during large transfers, reducing the sustained current the CPU+SPI combination
# draws from the shared 3.3 V rail — the main firmware-accessible lever for SPI
# induced audio noise.  The SPI ISR is kept in flash (not IRAM) to preserve the
# limited IRAM budget; ISR latency is acceptable since display renders are not
# timing-critical at 5 Hz / 50 ms.
CONFIG_SPI_MASTER_ISR_IN_IRAM=n

# Ring-buffer ISR and helper functions (used by RMT LED driver and I2S)
# can live in flash; latency is acceptable for our use case.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y

# ── Microphone sampling ───────────────────────────────────────────────
# The mic driver uses ESP_TIMER_TASK dispatch + adc_oneshot_read().
# No ISR-safe ADC variant is needed (adc_oneshot_read_isr is not available
# on the original ESP32 in IDF 5.x), and no IRAM placement is required.
# ESP_TIMER_TASK callbacks run in the esp_timer service task (priority 22),
# where the normal mutex-based adc_oneshot_read() is perfectly safe.
# The esp_timer service task stack is bumped to 8 KB (default 4 KB) because
# adc_oneshot_read() → ADC HAL → ADC LL → hardware-access helpers adds ~3 KB
# of call-chain depth on top of the task's own frame; the default 4 KB was
# occasionally tight under production conditions when both WiFi events and
# the timer callback fire concurrently on Core 0.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

